In [1]:
import pandas as pd

In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\hp\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\hp\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
s=[1,2,3,4,5]
d=pd.Series(s)

In [6]:
d

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [22]:
f=pd.Series(s,index=['a','b','c','d','e'])
f

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [24]:
q=pd.Series(s,index=['apple','banana','kiwi','orange','mango'])
q

apple     1
banana    2
kiwi      3
orange    4
mango     5
dtype: int64

In [26]:
a=['apple','banana','kiwi','orange','mango']
a

['apple', 'banana', 'kiwi', 'orange', 'mango']

In [28]:
d[0]

1

In [32]:
d[1:4]

1    2
2    3
3    4
dtype: int64

In [40]:
f['a':'c']

a    1
b    2
c    3
dtype: int64

In [42]:
a=[1,2,3,4,5,6]
a

[1, 2, 3, 4, 5, 6]

In [48]:
b=pd.Series(a,index=['a','b','c','d','e','f'])
b

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [50]:
b['d':]

d    4
e    5
f    6
dtype: int64

In [52]:
a[1:5]

[2, 3, 4, 5]

In [54]:
b['b':'d']

b    2
c    3
d    4
dtype: int64

In [56]:
b+2

a    3
b    4
c    5
d    6
e    7
f    8
dtype: int64

In [58]:
g=b+2
g

a    3
b    4
c    5
d    6
e    7
f    8
dtype: int64

In [60]:
g

a    3
b    4
c    5
d    6
e    7
f    8
dtype: int64

In [62]:
b*2

a     2
b     4
c     6
d     8
e    10
f    12
dtype: int64

In [84]:
#Element wise operation
d=pd.Series([1,4,7,3,7,5])
f=pd.Series([5,6,3,6,9,4])
add=d+f

In [74]:
add

0     6
1    10
2    10
3     9
4    16
5     9
dtype: int64

In [76]:
mult=d*f

In [78]:
mult

0     5
1    24
2    21
3    18
4    63
5    20
dtype: int64

In [80]:
sub=d-f

In [82]:
sub

0   -4
1   -2
2    4
3   -3
4   -2
5    1
dtype: int64

In [86]:
div=d/f
div

0    0.200000
1    0.666667
2    2.333333
3    0.500000
4    0.777778
5    1.250000
dtype: float64

In [88]:
c=d.add(f)
c

0     6
1    10
2    10
3     9
4    16
5     9
dtype: int64

In [90]:
g=d.sub(f)

In [92]:
g

0   -4
1   -2
2    4
3   -3
4   -2
5    1
dtype: int64

In [94]:
d.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [100]:
d.isnull().sum()

0

In [102]:
d.isna()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [104]:
d.dropna()

0    1
1    4
2    7
3    3
4    7
5    5
dtype: int64

In [9]:
d=pd.Series([1,2,3,4,5])
d

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [17]:
d=[1,2,3,4,5]
f=pd.Series(d,index=['a','b','c','d','e'])
f

a    1
b    2
c    3
3    4
4    5
dtype: int64

In [27]:
a=pd.Series([1,2,3,4,5])
b=pd.Series([1,2,3,4,5])

In [29]:
add=a+b
add

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [31]:
#creat a sample data set
data={
    'Name':['Alice','Bob','Charlie','David'],
    'Age':['25','30','35','40'],
    'Deparment':['HR','Finance','IT','Marketing'],
    'Salary':['50000','60000','70000','80000'] 
}
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David'],
 'Age': ['25', '30', '35', '40'],
 'Deparment': ['HR', 'Finance', 'IT', 'Marketing'],
 'Salary': ['50000', '60000', '70000', '80000']}

In [49]:
#convert data into a dataframe
df=pd.DataFrame(data)
#Save the dataframe to an csv file
df.to_csv('sample_file.csv',index=False)

In [53]:
ds=pd.read_csv('sample_file.csv')
ds

      Name  Age  Deparment  Salary
0    Alice   25         HR   50000
1      Bob   30    Finance   60000
2  Charlie   35         IT   70000
3    David   40  Marketing   80000

In [59]:
#save the data file to an excel file
df.to_excel('sample_file.xlsx',index=False)
#read
dx=pd.read_excel('sample_file.xlsx')
dx

      Name  Age  Deparment  Salary
0    Alice   25         HR   50000
1      Bob   30    Finance   60000
2  Charlie   35         IT   70000
3    David   40  Marketing   80000

In [61]:
#save the data file to an html file
df.to_html('sample_file.html',index=False)
#read
dh=pd.read_html('sample_file.html')
dh

[      Name  Age  Deparment  Salary
 0    Alice   25         HR   50000
 1      Bob   30    Finance   60000
 2  Charlie   35         IT   70000
 3    David   40  Marketing   80000]

In [65]:
#save the data file to an txt file
df.to_csv('sample_file.txt',sep='\t',index=False)
#read
dt=pd.read_table('sample_file.txt')
dt

      Name  Age  Deparment  Salary
0    Alice   25         HR   50000
1      Bob   30    Finance   60000
2  Charlie   35         IT   70000
3    David   40  Marketing   80000

# Pickle

In [71]:
#pickle
import pickle
data={
    'Name':['Alice','Bob','Charlie','David'],
    'Age':['25','30','35','40'],
    'Deparment':['HR','Finance','IT','Marketing'],
    'Salary':['50000','60000','70000','80000'] 
}

#save data as pickle file

with open('sample_data.pkl','wb')as file:
    #'wb' means write binary
    pickle.dump(data,file)

In [75]:
dp=pd.read_pickle('sample_data.pkl')
dp

{'Name': ['Alice', 'Bob', 'Charlie', 'David'],
 'Age': ['25', '30', '35', '40'],
 'Deparment': ['HR', 'Finance', 'IT', 'Marketing'],
 'Salary': ['50000', '60000', '70000', '80000']}

# Data frame cration

In [81]:
#From a list of dictionary
data=[{'Name':'Alice','Age':25,'city':'New york'},
      {'Name':'Bob','Age':30,'city':'Los angels'},
      {'Name':'Charliw','Age':35,'city':'Chicago'}
]
df=pd.DataFrame(data)
df

      Name  Age        city
0    Alice   25    New york
1      Bob   30  Los angels
2  Charliw   35     Chicago

In [85]:
data=[['Alice',30,'New york'],
      ['bob',35,'los angels'],
      ['charlie',40,'chicago']
]
df=pd.DataFrame(data,columns=['Name','Age','City'])
df

      Name  Age        City
0    Alice   30    New york
1      bob   35  los angels
2  charlie   40     chicago